
  ## *Staging* Terraform
  #### Format: ✅
  #### Init:   ✅
  #### Plan:   ✅

  <details><summary>Show Plan</summary>

  ```diff
  Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.shared.module.sns.data.aws_caller_identity.default: Refreshing state...
module.shared.data.aws_region.current_govcloud: Refreshing state...
module.shared.data.cloudfoundry_space.space: Refreshing state...
module.shared.module.queue.cloudfoundry_user_provided_service.queue_credentials: Refreshing state... [id=1bd1626a-7a50-4de9-86c0-efba8e31bf1e]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_ACCOUNT_URL"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_ACCOUNT_URL_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_READ_KEY"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_READ_KEY_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_READ_SECRET"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_READ_SECRET_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_REGION"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_REGION_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_REPO"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_REPO_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_WRITE_KEY"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_WRITE_KEY_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.circleci_environment_variable.circleci_env_vars["AWS_ECR_WRITE_SECRET"] will be created
  + resource "circleci_environment_variable" "circleci_env_vars" {
      + id           = (known after apply)
      + name         = "AWS_ECR_WRITE_SECRET_STAGING"
      + organization = "18F"
      + project      = "federalist-garden-build"
      + value        = (sensitive value)
    }

  # module.shared.module.ecr.data.aws_iam_policy_document.ecr_read_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr_read_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.shared.module.ecr.data.aws_iam_policy_document.ecr_write_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr_write_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:CompleteLayerUpload",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:TagResource",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.shared.module.ecr.aws_ecr_repository.federalist_ecr will be created
  + resource "aws_ecr_repository" "federalist_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "federalist-staging-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
        }
    }

  # module.shared.module.ecr.aws_iam_access_key.federalist_ecr_read_access_key will be created
  + resource "aws_iam_access_key" "federalist_ecr_read_access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-staging-ecr-read"
    }

  # module.shared.module.ecr.aws_iam_access_key.federalist_ecr_write_access_key will be created
  + resource "aws_iam_access_key" "federalist_ecr_write_access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-staging-ecr-write"
    }

  # module.shared.module.ecr.aws_iam_user.federalist_ecr_read will be created
  + resource "aws_iam_user" "federalist_ecr_read" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-staging-ecr-read"
      + path          = "/"
      + tags          = {
          + "Environment" = "staging"
        }
      + unique_id     = (known after apply)
    }

  # module.shared.module.ecr.aws_iam_user.federalist_ecr_write will be created
  + resource "aws_iam_user" "federalist_ecr_write" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-staging-ecr-write"
      + path          = "/"
      + tags          = {
          + "Environment" = "staging"
        }
      + unique_id     = (known after apply)
    }

  # module.shared.module.ecr.aws_iam_user_policy.federalist_ecr_read will be created
  + resource "aws_iam_user_policy" "federalist_ecr_read" {
      + id     = (known after apply)
      + name   = "federalist-staging-ecr-read"
      + policy = (known after apply)
      + user   = "federalist-staging-ecr-read"
    }

  # module.shared.module.ecr.aws_iam_user_policy.federalist_ecr_write will be created
  + resource "aws_iam_user_policy" "federalist_ecr_write" {
      + id     = (known after apply)
      + name   = "federalist-staging-ecr-write"
      + policy = (known after apply)
      + user   = "federalist-staging-ecr-write"
    }

  # module.shared.module.queue.data.aws_iam_policy_document.queue_alarm_sns_topic_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue_alarm_sns_topic_policy_document"  {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "__default_policy_ID"

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowCloudwatchEvents"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.shared.module.queue.data.aws_iam_policy_document.queue_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowReadingAndWritingMessages"
        }
    }

  # module.shared.module.queue.aws_cloudwatch_metric_alarm.queue_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "queue_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors sqs message delays"
      + alarm_name                            = "federalist-staging-queue-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateAgeOfOldestMessage"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = (known after apply)
      + period                                = 900
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "staging"
        }
      + threshold                             = 60
      + treat_missing_data                    = "ignore"
    }

  # module.shared.module.queue.aws_iam_access_key.queue_user_access_key will be created
  + resource "aws_iam_access_key" "queue_user_access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "federalist-staging-sqs-user"
    }

  # module.shared.module.queue.aws_iam_policy.queue_policy will be created
  + resource "aws_iam_policy" "queue_policy" {
      + arn         = (known after apply)
      + description = "SQS Queue Policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.shared.module.queue.aws_iam_user.queue_user will be created
  + resource "aws_iam_user" "queue_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "federalist-staging-sqs-user"
      + path          = "/"
      + tags          = {
          + "Environment" = "staging"
        }
      + unique_id     = (known after apply)
    }

  # module.shared.module.queue.aws_iam_user_policy_attachment.queue_user_policy_attach will be created
  + resource "aws_iam_user_policy_attachment" "queue_user_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "federalist-staging-sqs-user"
    }

  # module.shared.module.queue.aws_sns_topic_policy.queue_alarm_sns_topic_policy will be created
  + resource "aws_sns_topic_policy" "queue_alarm_sns_topic_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.shared.module.queue.aws_sqs_queue.queue will be created
  + resource "aws_sqs_queue" "queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "federalist-staging-sqs"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Environment" = "staging"
        }
      + visibility_timeout_seconds        = 30
    }

  # module.shared.module.queue.cloudfoundry_user_provided_service.queue_credentials will be updated in-place
  ~ resource "cloudfoundry_user_provided_service" "queue_credentials" {
      ~ credentials = (sensitive value)
        id          = "1bd1626a-7a50-4de9-86c0-efba8e31bf1e"
        name        = "federalist-staging-sqs-creds"
        space       = "af7be42d-47d6-4b4d-a15a-7098c7695c43"
        tags        = []
    }

  # module.shared.module.sns.data.aws_iam_policy_document.topic_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "topic_policy_document"  {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "__default_policy_ID"

      + statement {
          + actions   = [
              + "SNS:AddPermission",
              + "SNS:DeleteTopic",
              + "SNS:GetTopicAttributes",
              + "SNS:ListSubscriptionsByTopic",
              + "SNS:Publish",
              + "SNS:Receive",
              + "SNS:RemovePermission",
              + "SNS:SetTopicAttributes",
              + "SNS:Subscribe",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "__default_statement_ID"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "902143644410",
                ]
              + variable = "AWS:SourceOwner"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.shared.module.sns.aws_sns_topic.topic will be created
  + resource "aws_sns_topic" "topic" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_master_key_id = "alias/aws/sns"
      + name              = "federalist-staging-alerts-sns-alerts"
      + policy            = (known after apply)
      + tags              = {
          + "Environment" = "staging"
        }
    }

  # module.shared.module.sns.aws_sns_topic_policy.topic_policy will be created
  + resource "aws_sns_topic_policy" "topic_policy" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 23 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

  ```
  </details>            
